# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultipleValuesIndicationSettings..::..Value Property
MultipleValuesIndicationSettings Class See Also
---
Value to be used as multiple values indication in the document. If Custom is true, returns CustomValue, otherwise returns a hardcoded standard value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As String
	Get
```

Visual C++
---
```text
public:
property String^ Value {
	String^ get ();
}
```

# See Also
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace